src/main/resources/cassandra.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.5" jmeter="2.10 r1533061">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1384151808000</longProp>
        <longProp name="ThreadGroup.end_time">1384151808000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">10</stringProp>
        </LoopController>
        <hashTree>
          <com.github.cqljmeter.sampler.CqlSampler guiclass="TestBeanGUI" testclass="com.github.cqljmeter.sampler.CqlSampler" testname="Insert" enabled="true">
            <stringProp name="query">INSERT INTO t1 (id, num, str) values (now(), ${__Random(0,1000000,)}, &apos;${__RandomString(10,,)}&apos;)</stringProp>
            <stringProp name="contactPoint">127.0.0.1</stringProp>
            <stringProp name="keySpace">stress</stringProp>
            <stringProp name="clusterId">Cluster1</stringProp>
          </com.github.cqljmeter.sampler.CqlSampler>
          <hashTree/>
          <com.github.cqljmeter.sampler.CqlSampler guiclass="TestBeanGUI" testclass="com.github.cqljmeter.sampler.CqlSampler" testname="select" enabled="true">
            <stringProp name="clusterId">Cluster1</stringProp>
            <stringProp name="keySpace">stress</stringProp>
            <stringProp name="query">select * from t1 where num = ${__Random(0,1000000,)}</stringProp>
          </com.github.cqljmeter.sampler.CqlSampler>
          <hashTree/>
          <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <com.github.cqljmeter.config.CassandraClusterConfig guiclass="TestBeanGUI" testclass="com.github.cqljmeter.config.CassandraClusterConfig" testname="C* Cluster" enabled="true">
          <stringProp name="clusterId">Cluster1</stringProp>
          <stringProp name="contactPoint">127.0.0.1</stringProp>
        </com.github.cqljmeter.config.CassandraClusterConfig>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>